app/views/groups/index.html.erb

         <div class="fw-bold" >
          $<%= group.entities.sum(:amount) %>
---
SELECT SUM("entities"."amount") FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1  [["group_id", 1]]