app/views/groups/show.html.erb

SELECT "entities".* FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 1]]
---
    <h1>Transections</h1>
 <%@group.entities.each do |entity|%>