app/controllers/entities_controller.rb

    def new
      @groups = Group.all
      @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      @entity = current_user.entities.new(entity_params)
      @entity.author_id = current_user.id


        if @entity.save
          group = Group.find(params[:entity][:group_id])
---
INSERT INTO "entities" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "122"], ["amount", "12.0"], ["author_id", 1], ["created_at", "2023-06-07 10:25:48.313560"], ["updated_at", "2023-06-07 10:25:48.313560"]]
SELECT "entities".* FROM "entities" WHERE "entities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]