app/controllers/entities_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @group = Group.find(params[:group_id])