app/controllers/groups_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "entities".* FROM "entities" WHERE "entities"."id" IN ($1, $2, $3)  [["id", 13], ["id", 14], ["id", 15]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 1]]
---
    def index
      @user = User.find(current_user.id)
      @groups = Group.where(user_id: @user.id).includes(:entities)

SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "entities".* FROM "entities" INNER JOIN "group_entities" ON "entities"."id" = "group_entities"."entity_id" WHERE "group_entities"."group_id" = $1 ORDER BY created_at DESC  [["group_id", 1]]
---
      def show
        @user = current_user
        @group = Group.find(params[:id])
        @entities = @group.entities.order('created_at DESC')

INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mc Donalds"], ["icon", "burger"], ["user_id", 1], ["created_at", "2023-06-06 08:53:19.407183"], ["updated_at", "2023-06-06 08:53:19.407183"]]
---
    def create
      @group = current_user.groups.new(group_params)
      @group.user = current_user

      if @group.save